{
  "id": "antigravity-full-stack-orchestration-full-stack-feature",
  "name": "full-stack-orchestration-full-stack-feature",
  "slug": "full-stack-orchestration-full-stack-feature",
  "description": "Use when working with full stack orchestration full stack feature",
  "category": "Security & Systems",
  "source": "antigravity",
  "repoUrl": "https://github.com/sickn33/antigravity-awesome-skills",
  "skillUrl": "https://github.com/sickn33/antigravity-awesome-skills/tree/main/skills/full-stack-orchestration-full-stack-feature",
  "content": "\n## Use this skill when\n\n- Working on full stack orchestration full stack feature tasks or workflows\n- Needing guidance, best practices, or checklists for full stack orchestration full stack feature\n\n## Do not use this skill when\n\n- The task is unrelated to full stack orchestration full stack feature\n- You need a different domain or tool outside this scope\n\n## Instructions\n\n- Clarify goals, constraints, and required inputs.\n- Apply relevant best practices and validate outcomes.\n- Provide actionable steps and verification.\n- If detailed examples are required, open `resources/implementation-playbook.md`.\n\nOrchestrate full-stack feature development across backend, frontend, and infrastructure layers with modern API-first approach:\n\n[Extended thinking: This workflow coordinates multiple specialized agents to deliver a complete full-stack feature from architecture through deployment. It follows API-first development principles, ensuring contract-driven development where the API specification drives both backend implementation and frontend consumption. Each phase builds upon previous outputs, creating a cohesive system with proper separation of concerns, comprehensive testing, and production-ready deployment. The workflow emphasizes modern practices like component-driven UI development, feature flags, observability, and progressive rollout strategies.]\n\n## Phase 1: Architecture & Design Foundation\n\n### 1. Database Architecture Design\n- Use Task tool with subagent_type=\"database-design::database-architect\"\n- Prompt: \"Design database schema and data models for: $ARGUMENTS. Consider scalability, query patterns, indexing strategy, and data consistency requirements. Include migration strategy if modifying existing schema. Provide both logical and physical data models.\"\n- Expected output: Entity relationship diagrams, table schemas, indexing strategy, migration scripts, data access patterns\n- Context: Initial requirements and business domain model\n\n### 2. Backend Service Architecture\n- Use Task tool with subagent_type=\"backend-development::backend-architect\"\n- Prompt: \"Design backend service architecture for: $ARGUMENTS. Using the database design from previous step, create service boundaries, define API contracts (OpenAPI/GraphQL), design authentication/authorization strategy, and specify inter-service communication patterns. Include resilience patterns (circuit breakers, retries) and caching strategy.\"\n- Expected output: Service architecture diagram, OpenAPI specifications, authentication flows, caching architecture, message queue design (if applicable)\n- Context: Database schema from step 1, non-functional requirements\n\n### 3. Frontend Component Architecture\n- Use Task tool with subagent_type=\"frontend-mobile-development::frontend-developer\"\n- Prompt: \"Design frontend architecture and component structure for: $ARGUMENTS. Based on the API contracts from previous step, design component hierarchy, state management approach (Redux/Zustand/Context), routing structure, and data fetching patterns. Include accessibility requirements and responsive design strategy. Plan for Storybook component documentation.\"\n- Expected output: Component tree diagram, state management design, routing configuration, design system integration plan, accessibility checklist\n- Context: API specifications from step 2, UI/UX requirements\n\n## Phase 2: Parallel Implementation\n\n### 4. Backend Service Implementation\n- Use Task tool with subagent_type=\"python-development::python-pro\" (or \"golang-pro\"/\"nodejs-expert\" based on stack)\n- Prompt: \"Implement backend services for: $ARGUMENTS. Using the architecture and API specs from Phase 1, build RESTful/GraphQL endpoints with proper validation, error handling, and logging. Implement business logic, data access layer, authentication middleware, and integration with external services. Include observability (structured logging, metrics, tracing).\"\n- Expected output: Backend service code, API endpoints, middleware, background jobs, unit tests, integration tests\n- Context: Architecture designs from Phase 1, database schema\n\n### 5. Frontend Implementation\n- Use Task tool with subagent_type=\"frontend-mobile-development::frontend-developer\"\n- Prompt: \"Implement frontend application for: $ARGUMENTS. Build React/Next.js components using the component architecture from Phase 1. Implement state management, API integration with proper error handling and loading states, form validation, and responsive layouts. Create Storybook stories for components. Ensure accessibility (WCAG 2.1 AA compliance).\"\n- Expected output: React components, state management implementation, API client code, Storybook stories, responsive styles, accessibility implementations\n- Context: Component architecture from step 3, API contracts\n\n### 6. Database Implementation & Optimization\n- Use Task tool with subagent_type=\"database-design::sql-pro\"\n- Prompt: \"Implement and optimize database layer for: $ARGUMENTS. Create migration scripts, stored procedur",
  "tags": [
    "python",
    "react",
    "node",
    "api",
    "ai",
    "agent",
    "workflow",
    "template",
    "design",
    "document"
  ],
  "useCases": [],
  "scrapedAt": "2026-01-29T06:59:05.427Z"
}