{
  "id": "antigravity-data-engineering-data-driven-feature",
  "name": "data-engineering-data-driven-feature",
  "slug": "data-engineering-data-driven-feature",
  "description": "Build features guided by data insights, A/B testing, and continuous measurement using specialized agents for analysis, implementation, and experimentation.",
  "category": "Document Processing",
  "source": "antigravity",
  "repoUrl": "https://github.com/sickn33/antigravity-awesome-skills",
  "skillUrl": "https://github.com/sickn33/antigravity-awesome-skills/tree/main/skills/data-engineering-data-driven-feature",
  "content": "\n# Data-Driven Feature Development\n\nBuild features guided by data insights, A/B testing, and continuous measurement using specialized agents for analysis, implementation, and experimentation.\n\n[Extended thinking: This workflow orchestrates a comprehensive data-driven development process from initial data analysis and hypothesis formulation through feature implementation with integrated analytics, A/B testing infrastructure, and post-launch analysis. Each phase leverages specialized agents to ensure features are built based on data insights, properly instrumented for measurement, and validated through controlled experiments. The workflow emphasizes modern product analytics practices, statistical rigor in testing, and continuous learning from user behavior.]\n\n## Use this skill when\n\n- Working on data-driven feature development tasks or workflows\n- Needing guidance, best practices, or checklists for data-driven feature development\n\n## Do not use this skill when\n\n- The task is unrelated to data-driven feature development\n- You need a different domain or tool outside this scope\n\n## Instructions\n\n- Clarify goals, constraints, and required inputs.\n- Apply relevant best practices and validate outcomes.\n- Provide actionable steps and verification.\n- If detailed examples are required, open `resources/implementation-playbook.md`.\n\n## Phase 1: Data Analysis and Hypothesis Formation\n\n### 1. Exploratory Data Analysis\n- Use Task tool with subagent_type=\"machine-learning-ops::data-scientist\"\n- Prompt: \"Perform exploratory data analysis for feature: $ARGUMENTS. Analyze existing user behavior data, identify patterns and opportunities, segment users by behavior, and calculate baseline metrics. Use modern analytics tools (Amplitude, Mixpanel, Segment) to understand current user journeys, conversion funnels, and engagement patterns.\"\n- Output: EDA report with visualizations, user segments, behavioral patterns, baseline metrics\n\n### 2. Business Hypothesis Development\n- Use Task tool with subagent_type=\"business-analytics::business-analyst\"\n- Context: Data scientist's EDA findings and behavioral patterns\n- Prompt: \"Formulate business hypotheses for feature: $ARGUMENTS based on data analysis. Define clear success metrics, expected impact on key business KPIs, target user segments, and minimum detectable effects. Create measurable hypotheses using frameworks like ICE scoring or RICE prioritization.\"\n- Output: Hypothesis document, success metrics definition, expected ROI calculations\n\n### 3. Statistical Experiment Design\n- Use Task tool with subagent_type=\"machine-learning-ops::data-scientist\"\n- Context: Business hypotheses and success metrics\n- Prompt: \"Design statistical experiment for feature: $ARGUMENTS. Calculate required sample size for statistical power, define control and treatment groups, specify randomization strategy, and plan for multiple testing corrections. Consider Bayesian A/B testing approaches for faster decision making. Design for both primary and guardrail metrics.\"\n- Output: Experiment design document, power analysis, statistical test plan\n\n## Phase 2: Feature Architecture and Analytics Design\n\n### 4. Feature Architecture Planning\n- Use Task tool with subagent_type=\"data-engineering::backend-architect\"\n- Context: Business requirements and experiment design\n- Prompt: \"Design feature architecture for: $ARGUMENTS with A/B testing capability. Include feature flag integration (LaunchDarkly, Split.io, or Optimizely), gradual rollout strategy, circuit breakers for safety, and clean separation between control and treatment logic. Ensure architecture supports real-time configuration updates.\"\n- Output: Architecture diagrams, feature flag schema, rollout strategy\n\n### 5. Analytics Instrumentation Design\n- Use Task tool with subagent_type=\"data-engineering::data-engineer\"\n- Context: Feature architecture and success metrics\n- Prompt: \"Design comprehensive analytics instrumentation for: $ARGUMENTS. Define event schemas for user interactions, specify properties for segmentation and analysis, design funnel tracking and conversion events, plan cohort analysis capabilities. Implement using modern SDKs (Segment, Amplitude, Mixpanel) with proper event taxonomy.\"\n- Output: Event tracking plan, analytics schema, instrumentation guide\n\n### 6. Data Pipeline Architecture\n- Use Task tool with subagent_type=\"data-engineering::data-engineer\"\n- Context: Analytics requirements and existing data infrastructure\n- Prompt: \"Design data pipelines for feature: $ARGUMENTS. Include real-time streaming for live metrics (Kafka, Kinesis), batch processing for detailed analysis, data warehouse integration (Snowflake, BigQuery), and feature store for ML if applicable. Ensure proper data governance and GDPR compliance.\"\n- Output: Pipeline architecture, ETL/ELT specifications, data flow diagrams\n\n## Phase 3: Implementation with Instrumentation\n\n### 7. Backend Implementation\n- Use Task tool with subagent_type=\"backend-development::backend-architect\"\n- Cont",
  "tags": [
    "api",
    "ai",
    "agent",
    "workflow",
    "design",
    "document",
    "rag"
  ],
  "useCases": [],
  "scrapedAt": "2026-01-29T06:58:37.573Z"
}